{"title":"BLENDPD — Blend Packed Double Precision Floating-Point Values","fields":[{"name":"Instruction Modes","value":"`ib BLENDPD xmm1, xmm2/m128, imm8`\n`ib VBLENDPD xmm1, xmm2, xmm3/m128, imm8`\n`ib VBLENDPD ymm1, ymm2, ymm3/m256, imm8`"},{"name":"Description","value":"Double-precision floating-point values from the second source operand (third operand) are conditionally merged with values from the first source operand (second operand) and written to the destination operand (first operand). The immediate bits [3:0] determine whether the corresponding double-precision floating-point value in the destination is copied from the second source or first source. If a bit in the mask, corresponding to a word, is ”1”, then the double-precision floating-point value in the second source operand is copied, else the value in the first source operand is copied."},{"name":"​","value":"128-bit Legacy SSE version: The second source can be an XMM register or an 128-bit memory location. The destination is not distinct from the first source XMM register and the upper bits (MAXVL-1:128) of the corresponding YMM register destination are unmodified."},{"name":"​","value":"VEX.128 encoded version: the first source operand is an XMM register. The second source operand is an XMM register or 128-bit memory location. The destination operand is an XMM register. The upper bits (MAXVL-1:128) of the corresponding YMM register destination are zeroed."},{"name":"​","value":"VEX.256 encoded version: The first source operand is a YMM register. The second source operand can be a YMM register or a 256-bit memory location. The destination operand is a YMM register."},{"name":"C/C++ Intrinsics","value":"`BLENDPD: __m128d _mm_blend_pd (__m128d v1, __m128d v2, const int mask);\n`"},{"name":"​","value":"`VBLENDPD: __m256d _mm256_blend_pd (__m256d a, __m256d b, const int mask);\n`"},{"name":"CPUID Flags","value":"SSE4_1"}],"color":65535,"footer":{"text":"Thanks to Felix Cloutier for the online x86 reference"}}