{"title":"BNDLDX — Load Extended Bounds Using Address Translation","fields":[{"name":"Instruction Modes","value":"`BNDLDX bnd, mib`"},{"name":"Description","value":"BNDLDX uses the linear address constructed from the base register and displacement of the SIB-addressing form of the memory operand (mib) to perform address translation to access a bound table entry and conditionally load the bounds in the BTE to the destination. The destination register is updated with the bounds in the BTE, if the content of the index register of mib matches the pointer value stored in the BTE."},{"name":"​","value":"If the pointer value comparison fails, the destination is updated with INIT bounds (lb = 0x0, ub = 0x0) (note: as articulated earlier, the upper bound is represented using 1's complement, therefore, the 0x0 value of upper bound allows for access to full memory)."},{"name":"​","value":"This instruction does not cause memory access to the linear address of mib nor the effective address referenced by the base, and does not read or write any flags."},{"name":"​","value":"Segment overrides apply to the linear address computation with the base of mib, and are used during address translation to generate the address of the bound table entry. By default, the address of the BTE is assumed to be linear address. There are no segmentation checks performed on the base of mib."},{"name":"​","value":"The base of mib will not be checked for canonical address violation as it does not access memory."},{"name":"​","value":"Any encoding of this instruction that does not specify base or index register will treat those registers as zero (constant). The reg-reg form of this instruction will remain a NOP."},{"name":"​","value":"The scale field of the SIB byte has no effect on these instructions and is ignored."},{"name":"​","value":"The bound register may be partially updated on memory faults. The order in which memory operands are loaded is implementation specific."},{"name":"C/C++ Intrinsics","value":"`BNDLDX: Generated by compiler as needed.\n`"},{"name":"CPUID Flags","value":"MPX"}],"color":65535,"footer":{"text":"Thanks to Felix Cloutier for the online x86 reference"}}