{"title":"CVTSD2SS — Convert Scalar Double-Precision Floating-Point Value to Scalar Single-Precision Floating-Point Value","fields":[{"name":"Instruction Modes","value":"`CVTSD2SS xmm1, xmm2/m64`\n`VCVTSD2SS xmm1,xmm2, xmm3/m64`\n`VCVTSD2SS xmm1 {k1}{z}, xmm2, xmm3/m64{er}`"},{"name":"Description","value":"Converts a double-precision floating-point value in the “convert-from” source operand (the second operand in SSE2 version, otherwise the third operand) to a single-precision floating-point value in the destination operand."},{"name":"​","value":"When the “convert-from” operand is an XMM register, the double-precision floating-point value is contained in the low quadword of the register. The result is stored in the low doubleword of the destination operand. When the conversion is inexact, the value returned is rounded according to the rounding control bits in the MXCSR register."},{"name":"​","value":"128-bit Legacy SSE version: The “convert-from” source operand (the second operand) is an XMM register or memory location. Bits (MAXVL-1:32) of the corresponding destination register remain unchanged. The destination operand is an XMM register."},{"name":"​","value":"VEX.128 and EVEX encoded versions: The “convert-from” source operand (the third operand) can be an XMM register or a 64-bit memory location. The first source and destination operands are XMM registers. Bits (127:32) of the XMM register destination are copied from the corresponding bits in the first source operand. Bits (MAXVL-1:128) of the destination register are zeroed."},{"name":"​","value":"EVEX encoded version: the converted result in written to the low doubleword element of the destination under the writemask."},{"name":"​","value":"Software should ensure VCVTSD2SS is encoded with VEX.L=0. Encoding VCVTSD2SS with VEX.L=1 may encounter unpredictable behavior across different processor generations."},{"name":"C/C++ Intriniscs","value":"`VCVTSD2SS __m128 _mm_mask_cvtsd_ss(__m128 s, __mmask8 k, __m128 a, __m128d b);\n`"},{"name":"​","value":"`VCVTSD2SS __m128 _mm_maskz_cvtsd_ss( __mmask8 k, __m128 a,__m128d b);\n`"},{"name":"​","value":"`VCVTSD2SS __m128 _mm_cvt_roundsd_ss(__m128 a, __m128d b, int r);\n`"},{"name":"​","value":"`VCVTSD2SS __m128 _mm_mask_cvt_roundsd_ss(__m128 s, __mmask8 k, __m128 a, __m128d b, int r);\n`"},{"name":"​","value":"`VCVTSD2SS __m128 _mm_maskz_cvt_roundsd_ss( __mmask8 k, __m128 a,__m128d b, int r);\n`"},{"name":"​","value":"`CVTSD2SS __m128_mm_cvtsd_ss(__m128 a, __m128d b)\n`"},{"name":"CPUID Flags","value":"SSE2"}],"footer":{"text":"Thanks to Felix Cloutier for the online x86 reference"}}