{"title":"FADD/FADDP/FIADD — Add","fields":[{"name":"Instruction Modes","value":"`FADD m32fp`\n`FADD m64fp`\n`FADD ST(0), ST(i)`\n`FADD ST(i), ST(0)`\n`FADDP ST(i), ST(0)`\n`FADDP`\n`FIADD m32int`\n`FIADD m16int`"},{"name":"Description","value":"Adds the destination and source operands and stores the sum in the destination location. The destination operand is always an FPU register; the source operand can be a register or a memory location. Source operands in memory can be in single-precision or double-precision floating-point format or in word or doubleword integer format."},{"name":"​","value":"The no-operand version of the instruction adds the contents of the ST(0) register to the ST(1) register. The one-operand version adds the contents of a memory location (either a floating-point or an integer value) to the contents of the ST(0) register. The two-operand version, adds the contents of the ST(0) register to the ST(i) register or vice versa. The value in ST(0) can be doubled by coding:"},{"name":"​","value":"FADD ST(0), ST(0);"},{"name":"​","value":"The FADDP instructions perform the additional operation of popping the FPU register stack after storing the result. To pop the register stack, the processor marks the ST(0) register as empty and increments the stack pointer (TOP) by 1. (The no-operand version of the floating-point add instructions always results in the register stack being popped. In some assemblers, the mnemonic for this instruction is FADD rather than FADDP.)"},{"name":"​","value":"The FIADD instructions convert an integer source operand to double extended-precision floating-point format before performing the addition."},{"name":"​","value":"The table on the following page shows the results obtained when adding various classes of numbers, assuming that neither overflow nor underflow occurs."},{"name":"​","value":"When the sum of two operands with opposite signs is 0, the result is +0, except for the round toward −∞ mode, in which case the result is −0. When the source operand is an integer 0, it is treated as a +0."},{"name":"​","value":"When both operand are infinities of the same sign, the result is ∞ of the expected sign. If both operands are infinities of opposite signs, an invalid-operation exception is generated. See Table 3-18."}],"color":65535,"footer":{"text":"Thanks to Felix Cloutier for the online x86 reference"}}