{"title":"FDIVR/FDIVRP/FIDIVR — Reverse Divide","fields":[{"name":"Instruction Modes","value":"`FDIVR m32fp`\n`FDIVR m64fp`\n`FDIVR ST(0), ST(i)`\n`FDIVR ST(i), ST(0)`\n`FDIVRP ST(i), ST(0)`\n`FDIVRP`\n`FIDIVR m32int`\n`FIDIVR m16int`"},{"name":"Description","value":"Divides the source operand by the destination operand and stores the result in the destination location. The destination operand (divisor) is always in an FPU register; the source operand (dividend) can be a register or a memory location. Source operands in memory can be in single-precision or double-precision floating-point format, word or doubleword integer format."},{"name":"​","value":"These instructions perform the reverse operations of the FDIV, FDIVP, and FIDIV instructions. They are provided to support more efficient coding."},{"name":"​","value":"The no-operand version of the instruction divides the contents of the ST(0) register by the contents of the ST(1) register. The one-operand version divides the contents of a memory location (either a floating-point or an integer value) by the contents of the ST(0) register. The two-operand version, divides the contents of the ST(i) register by the contents of the ST(0) register or vice versa."},{"name":"​","value":"The FDIVRP instructions perform the additional operation of popping the FPU register stack after storing the result. To pop the register stack, the processor marks the ST(0) register as empty and increments the stack pointer (TOP) by 1. The no-operand version of the floating-point divide instructions always results in the register stack being popped. In some assemblers, the mnemonic for this instruction is FDIVR rather than FDIVRP."},{"name":"​","value":"The FIDIVR instructions convert an integer source operand to double extended-precision floating-point format before performing the division."},{"name":"​","value":"If an unmasked divide-by-zero exception (#Z) is generated, no result is stored; if the exception is masked, an ∞ of the appropriate sign is stored in the destination operand."},{"name":"​","value":"The following table shows the results obtained when dividing various classes of numbers, assuming that neither overflow nor underflow occurs."}],"footer":{"text":"Thanks to Felix Cloutier for the online x86 reference"}}