{"title":"FST/FSTP — Store Floating Point Value","fields":[{"name":"Instruction Modes","value":"`FST m32fp`\n`FST m64fp`\n`FST ST(i)`\n`FSTP m32fp`\n`FSTP m64fp`\n`FSTP m80fp`\n`FSTP ST(i)`"},{"name":"Description","value":"The FST instruction copies the value in the ST(0) register to the destination operand, which can be a memory location or another register in the FPU register stack. When storing the value in memory, the value is converted to single-precision or double-precision floating-point format."},{"name":"​","value":"The FSTP instruction performs the same operation as the FST instruction and then pops the register stack. To pop the register stack, the processor marks the ST(0) register as empty and increments the stack pointer (TOP) by 1. The FSTP instruction can also store values in memory in double extended-precision floating-point format."},{"name":"​","value":"If the destination operand is a memory location, the operand specifies the address where the first byte of the destination value is to be stored. If the destination operand is a register, the operand specifies a register in the register stack relative to the top of the stack."},{"name":"​","value":"If the destination size is single-precision or double-precision, the significand of the value being stored is rounded to the width of the destination (according to the rounding mode specified by the RC field of the FPU control word), and the exponent is converted to the width and bias of the destination format. If the value being stored is too large for the destination format, a numeric overflow exception (#O) is generated and, if the exception is unmasked, no value is stored in the destination operand. If the value being stored is a denormal value, the denormal exception (#D) is not generated. This condition is simply signaled as a numeric underflow exception (#U) condition."},{"name":"​","value":"If the value being stored is ±0, ±∞, or a NaN, the least-significant bits of the significand and the exponent are truncated to fit the destination format. This operation preserves the value’s identity as a 0, ∞, or NaN."},{"name":"​","value":"If the destination operand is a non-empty register, the invalid-operation exception is not generated."},{"name":"​","value":"This instruction’s operation is the same in non-64-bit modes and 64-bit mode."}],"footer":{"text":"Thanks to Felix Cloutier for the online x86 reference"}}