{"title":"FSUB/FSUBP/FISUB — Subtract","fields":[{"name":"Instruction Modes","value":"`FSUB m32fp`\n`FSUB m64fp`\n`FSUB ST(0), ST(i)`\n`FSUB ST(i), ST(0)`\n`FSUBP ST(i), ST(0)`\n`FSUBP`\n`FISUB m32int`\n`FISUB m16int`"},{"name":"Description","value":"Subtracts the source operand from the destination operand and stores the difference in the destination location. The destination operand is always an FPU data register; the source operand can be a register or a memory location. Source operands in memory can be in single-precision or double-precision floating-point format or in word or doubleword integer format."},{"name":"​","value":"The no-operand version of the instruction subtracts the contents of the ST(0) register from the ST(1) register and stores the result in ST(1). The one-operand version subtracts the contents of a memory location (either a floating-point or an integer value) from the contents of the ST(0) register and stores the result in ST(0). The two-operand version, subtracts the contents of the ST(0) register from the ST(i) register or vice versa."},{"name":"​","value":"The FSUBP instructions perform the additional operation of popping the FPU register stack following the subtraction. To pop the register stack, the processor marks the ST(0) register as empty and increments the stack pointer (TOP) by 1. The no-operand version of the floating-point subtract instructions always results in the register stack being popped. In some assemblers, the mnemonic for this instruction is FSUB rather than FSUBP."},{"name":"​","value":"The FISUB instructions convert an integer source operand to double extended-precision floating-point format before performing the subtraction."},{"name":"​","value":"Table 3-38 shows the results obtained when subtracting various classes of numbers from one another, assuming that neither overflow nor underflow occurs. Here, the SRC value is subtracted from the DEST value (DEST − SRC = result)."},{"name":"​","value":"When the difference between two operands of like sign is 0, the result is +0, except for the round toward −∞ mode, in which case the result is −0. This instruction also guarantees that +0 − (−0) = +0, and that −0 − (+0) = −0. When the source operand is an integer 0, it is treated as a +0."},{"name":"​","value":"When one operand is ∞, the result is ∞ of the expected sign. If both operands are ∞ of the same sign, an invalidoperation exception is generated."}],"footer":{"text":"Thanks to Felix Cloutier for the online x86 reference"}}