{"title":"LDS/LES/LFS/LGS/LSS — Load Far Pointer","fields":[{"name":"Instruction Modes","value":"`LDS r16,m16:16`\n`LDS r32,m16:32`\n`LSS r16,m16:16`\n`LSS r32,m16:32`\n`LSS r64,m16:64`\n`LES r16,m16:16`\n`LES r32,m16:32`\n`LFS r16,m16:16`\n`LFS r32,m16:32`\n`LFS r64,m16:64`\n`LGS r16,m16:16`\n`LGS r32,m16:32`\n`LGS r64,m16:64`"},{"name":"Description","value":"Loads a far pointer (segment selector and offset) from the second operand (source operand) into a segment register and the first operand (destination operand). The source operand specifies a 48-bit or a 32-bit pointer in memory depending on the current setting of the operand-size attribute (32 bits or 16 bits, respectively). The instruction opcode and the destination operand specify a segment register/general-purpose register pair. The 16-bit segment selector from the source operand is loaded into the segment register specified with the opcode (DS, SS, ES, FS, or GS). The 32-bit or 16-bit offset is loaded into the register specified with the destination operand."},{"name":"​","value":"If one of these instructions is executed in protected mode, additional information from the segment descriptor pointed to by the segment selector in the source operand is loaded in the hidden part of the selected segment register."},{"name":"​","value":"Also in protected mode, a NULL selector (values 0000 through 0003) can be loaded into DS, ES, FS, or GS registers without causing a protection exception. (Any subsequent reference to a segment whose corresponding segment register is loaded with a NULL selector, causes a general-protection exception (#GP) and no memory reference to the segment occurs.)"},{"name":"​","value":"In 64-bit mode, the instruction’s default operation size is 32 bits. Using a REX prefix in the form of REX.W promotes operation to specify a source operand referencing an 80-bit pointer (16-bit selector, 64-bit offset) in memory. Using a REX prefix in the form of REX.R permits access to additional registers (R8-R15). See the summary chart at the beginning of this section for encoding data and limits."}],"color":65535,"footer":{"text":"Thanks to Felix Cloutier for the online x86 reference"}}