{"title":"PACKUSWB — Pack with Unsigned Saturation","fields":[{"name":"Instruction Modes","value":"`PACKUSWB mm, mm/m64`\n`PACKUSWB xmm1, xmm2/m128`\n`VPACKUSWB xmm1, xmm2, xmm3/m128`\n`VPACKUSWB ymm1, ymm2, ymm3/m256`\n`VPACKUSWB xmm1{k1}{z}, xmm2, xmm3/m128`\n`VPACKUSWB ymm1{k1}{z}, ymm2, ymm3/m256`\n`VPACKUSWB zmm1{k1}{z}, zmm2, zmm3/m512`"},{"name":"Description","value":"Converts 4, 8, 16 or 32 signed word integers from the destination operand (first operand) and 4, 8, 16 or 32 signed word integers from the source operand (second operand) into 8, 16, 32 or 64 unsigned byte integers and stores the result in the destination operand. (See Figure 4-6 for an example of the packing operation.) If a signed word integer value is beyond the range of an unsigned byte integer (that is, greater than FFH or less than 00H), the saturated unsigned byte integer value of FFH or 00H, respectively, is stored in the destination."},{"name":"​","value":"EVEX.512 encoded version: The first source operand is a ZMM register. The second source operand is a ZMM register or a 512-bit memory location. The destination operand is a ZMM register."},{"name":"​","value":"VEX.256 and EVEX.256 encoded versions: The first source operand is a YMM register. The second source operand is a YMM register or a 256-bit memory location. The destination operand is a YMM register. The upper bits (MAXVL-1:256) of the corresponding ZMM register destination are zeroed."},{"name":"​","value":"VEX.128 and EVEX.128 encoded versions: The first source operand is an XMM register. The second source operand is an XMM register or 128-bit memory location. The destination operand is an XMM register. The upper bits (MAXVL-1:128) of the corresponding register destination are zeroed."},{"name":"​","value":"128-bit Legacy SSE version: The first source operand is an XMM register. The second operand can be an XMM register or an 128-bit memory location. The destination is not distinct from the first source XMM register and the upper bits (MAXVL-1:128) of the corresponding register destination are unmodified."},{"name":"CPUID Flags","value":"MMX"}],"color":65535,"footer":{"text":"Thanks to Felix Cloutier for the online x86 reference"}}