{"title":"PMULDQ — Multiply Packed Doubleword Integers","fields":[{"name":"Instruction Modes","value":"`PMULDQ xmm1, xmm2/m128`\n`VPMULDQ xmm1, xmm2, xmm3/m128`\n`VPMULDQ ymm1, ymm2, ymm3/m256`\n`VPMULDQ xmm1 {k1}{z}, xmm2, xmm3/m128/m64bcst`\n`VPMULDQ ymm1 {k1}{z}, ymm2, ymm3/m256/m64bcst`\n`VPMULDQ zmm1 {k1}{z}, zmm2, zmm3/m512/m64bcst`"},{"name":"Description","value":"Multiplies packed signed doubleword integers in the even-numbered (zero-based reference) elements of the first source operand with the packed signed doubleword integers in the corresponding elements of the second source operand and stores packed signed quadword results in the destination operand."},{"name":"​","value":"128-bit Legacy SSE version: The input signed doubleword integers are taken from the even-numbered elements of the source operands, i.e. the first (low) and third doubleword element. For 128-bit memory operands, 128 bits are fetched from memory, but only the first and third doublewords are used in the computation. The first source operand and the destination XMM operand is the same. The second source operand can be an XMM register or 128-bit memory location. Bits (MAXVL-1:128) of the corresponding destination register remain unchanged."},{"name":"​","value":"VEX.128 encoded version: The input signed doubleword integers are taken from the even-numbered elements of the source operands, i.e., the first (low) and third doubleword element. For 128-bit memory operands, 128 bits are fetched from memory, but only the first and third doublewords are used in the computation.The first source operand and the destination operand are XMM registers. The second source operand can be an XMM register or 128-bit memory location. Bits (MAXVL-1:128) of the corresponding destination register are zeroed."},{"name":"​","value":"VEX.256 encoded version: The input signed doubleword integers are taken from the even-numbered elements of the source operands, i.e. the first, 3rd, 5th, 7th doubleword element. For 256-bit memory operands, 256 bits are fetched from memory, but only the four even-numbered doublewords are used in the computation. The first source operand and the destination operand are YMM registers. The second source operand can be a YMM register or 256-bit memory location. Bits (MAXVL-1:256) of the corresponding destination ZMM register are zeroed."},{"name":"​","value":"EVEX encoded version: The input signed doubleword integers are taken from the even-numbered elements of the source operands. The first source operand is a ZMM/YMM/XMM registers. The second source operand can be an ZMM/YMM/XMM register, a 512/256/128-bit memory location or a 512/256/128-bit vector broadcasted from a 64-bit memory location. The destination is a ZMM/YMM/XMM register, and updated according to the writemask at 64-bit granularity."},{"name":"C/C++ Intriniscs","value":"`VPMULDQ __m512i _mm512_mul_epi32(__m512i a, __m512i b);\n`"},{"name":"​","value":"`VPMULDQ __m512i _mm512_mask_mul_epi32(__m512i s, __mmask8 k, __m512i a, __m512i b);\n`"},{"name":"​","value":"`VPMULDQ __m512i _mm512_maskz_mul_epi32( __mmask8 k, __m512i a, __m512i b);\n`"},{"name":"​","value":"`VPMULDQ __m256i _mm256_mask_mul_epi32(__m256i s, __mmask8 k, __m256i a, __m256i b);\n`"},{"name":"​","value":"`VPMULDQ __m256i _mm256_mask_mul_epi32( __mmask8 k, __m256i a, __m256i b);\n`"},{"name":"​","value":"`VPMULDQ __m128i _mm_mask_mul_epi32(__m128i s, __mmask8 k, __m128i a, __m128i b);\n`"},{"name":"​","value":"`VPMULDQ __m128i _mm_mask_mul_epi32( __mmask8 k, __m128i a, __m128i b);\n`"},{"name":"​","value":"`(V)PMULDQ __m128i _mm_mul_epi32( __m128i a, __m128i b);\n`"},{"name":"​","value":"`VPMULDQ __m256i _mm256_mul_epi32( __m256i a, __m256i b);\n`"},{"name":"CPUID Flags","value":"SSE4_1"}],"footer":{"text":"Thanks to Felix Cloutier for the online x86 reference"}}