{"title":"RCL/RCR/ROL/ROR — Rotate","fields":[{"name":"Instruction Modes","value":"`RCL r/m8, 1`\n`RCL r/m8*, 1`\n`RCL r/m8, CL`\n`RCL r/m8*, CL`\n`RCL r/m8, imm8`\n`RCL r/m8*, imm8`\n`RCL r/m16, 1`\n`RCL r/m16, CL`\n`RCL r/m16, imm8`\n`RCL r/m32, 1`\n`RCL r/m64, 1`\n`RCL r/m32, CL`\n`RCL r/m64, CL`\n`RCL r/m32, imm8`\n`RCL r/m64, imm8`\n`RCR r/m8, 1`\n`RCR r/m8*, 1`\n`RCR r/m8, CL`\n`RCR r/m8*, CL`\n`RCR r/m8, imm8`\n`RCR r/m8*, imm8`\n`RCR r/m16, 1`\n`RCR r/m16, CL`\n`RCR r/m16, imm8`\n`RCR r/m32, 1`\n`RCR r/m64, 1`\n`RCR r/m32, CL`\n`RCR r/m64, CL`\n`RCR r/m32, imm8`\n`RCR r/m64, imm8`\n`ROL r/m8, 1`\n`ROL r/m8*, 1`\n`ROL r/m8, CL`\n`ROL r/m8*, CL`\n`ROL r/m8, imm8`\n`ROL r/m8*, imm8`\n`ROL r/m16, 1`\n`ROL r/m16, CL`\n`ROL r/m16, imm8`\n`ROL r/m32, 1`\n`ROL r/m64, 1`\n`ROL r/m32, CL`\n`ROL r/m64, CL`\n`ROL r/m32, imm8`\n`ROL r/m64, imm8`\n`ROR r/m8, 1`\n`ROR r/m8*, 1`\n`ROR r/m8, CL`\n`ROR r/m8*, CL`\n`ROR r/m8, imm8`\n`ROR r/m8*, imm8`\n`ROR r/m16, 1`\n`ROR r/m16, CL`\n`ROR r/m16, imm8`\n`ROR r/m32, 1`\n`ROR r/m64, 1`\n`ROR r/m32, CL`\n`ROR r/m64, CL`\n`ROR r/m32, imm8`\n`ROR r/m64, imm8`"},{"name":"Description","value":"Shifts (rotates) the bits of the first operand (destination operand) the number of bit positions specified in the second operand (count operand) and stores the result in the destination operand. The destination operand can be a register or a memory location; the count operand is an unsigned integer that can be an immediate or a value in the CL register. The count is masked to 5 bits (or 6 bits if in 64-bit mode and REX.W = 1)."},{"name":"​","value":"The rotate left (ROL) and rotate through carry left (RCL) instructions shift all the bits toward more-significant bit positions, except for the most-significant bit, which is rotated to the least-significant bit location. The rotate right (ROR) and rotate through carry right (RCR) instructions shift all the bits toward less significant bit positions, except for the least-significant bit, which is rotated to the most-significant bit location."},{"name":"​","value":"The RCL and RCR instructions include the CF flag in the rotation. The RCL instruction shifts the CF flag into the least-significant bit and shifts the most-significant bit into the CF flag. The RCR instruction shifts the CF flag into the most-significant bit and shifts the least-significant bit into the CF flag. For the ROL and ROR instructions, the original value of the CF flag is not a part of the result, but the CF flag receives a copy of the bit that was shifted from one end to the other."},{"name":"​","value":"The OF flag is defined only for the 1-bit rotates; it is undefined in all other cases (except RCL and RCR instructions only: a zero-bit rotate does nothing, that is affects no flags). For left rotates, the OF flag is set to the exclusive OR of the CF bit (after the rotate) and the most-significant bit of the result. For right rotates, the OF flag is set to the exclusive OR of the two most-significant bits of the result."},{"name":"​","value":"In 64-bit mode, using a REX prefix in the form of REX.R permits access to additional registers (R8-R15). Use of REX.W promotes the first operand to 64 bits and causes the count operand to become a 6-bit counter."}],"footer":{"text":"Thanks to Felix Cloutier for the online x86 reference"}}