{"title":"UCOMISS — Unordered Compare Scalar Single-Precision Floating-Point Values and Set EFLAGS","fields":[{"name":"Instruction Modes","value":"`UCOMISS xmm1, xmm2/m32`\n`VUCOMISS xmm1, xmm2/m32`\n`VUCOMISS xmm1, xmm2/m32{sae}`"},{"name":"Description","value":"Compares the single-precision floating-point values in the low doublewords of operand 1 (first operand) and operand 2 (second operand), and sets the ZF, PF, and CF flags in the EFLAGS register according to the result (unordered, greater than, less than, or equal). The OF, SF and AF flags in the EFLAGS register are set to 0. The unordered result is returned if either source operand is a NaN (QNaN or SNaN)."},{"name":"​","value":"Operand 1 is an XMM register; operand 2 can be an XMM register or a 32 bit memory location."},{"name":"​","value":"The UCOMISS instruction differs from the COMISS instruction in that it signals a SIMD floating-point invalid operation exception (#I) only if a source operand is an SNaN. The COMISS instruction signals an invalid numeric exception when a source operand is either a QNaN or SNaN."},{"name":"​","value":"The EFLAGS register is not updated if an unmasked SIMD floating-point exception is generated."},{"name":"​","value":"Note: VEX.vvvv and EVEX.vvvv are reserved and must be 1111b, otherwise instructions will #UD."},{"name":"​","value":"Software should ensure VCOMISS is encoded with VEX.L=0. Encoding VCOMISS with VEX.L=1 may encounter unpredictable behavior across different processor generations."},{"name":"C/C++ Intriniscs","value":"`VUCOMISS int _mm_comi_round_ss(__m128 a, __m128 b, int imm, int sae);\n`"},{"name":"​","value":"`UCOMISS int _mm_ucomieq_ss(__m128 a, __m128 b);\n`"},{"name":"​","value":"`UCOMISS int _mm_ucomilt_ss(__m128 a, __m128 b);\n`"},{"name":"​","value":"`UCOMISS int _mm_ucomile_ss(__m128 a, __m128 b);\n`"},{"name":"​","value":"`UCOMISS int _mm_ucomigt_ss(__m128 a, __m128 b);\n`"},{"name":"​","value":"`UCOMISS int _mm_ucomige_ss(__m128 a, __m128 b);\n`"},{"name":"​","value":"`UCOMISS int _mm_ucomineq_ss(__m128 a, __m128 b);\n`"},{"name":"CPUID Flags","value":"SSE"}],"footer":{"text":"Thanks to Felix Cloutier for the online x86 reference"}}