{"title":"VRCP14PD — Compute Approximate Reciprocals of Packed Float64 Values","fields":[{"name":"Instruction Modes","value":"`VRCP14PD xmm1 {k1}{z}, xmm2/m128/m64bcst`\n`VRCP14PD ymm1 {k1}{z}, ymm2/m256/m64bcst`\n`VRCP14PD zmm1 {k1}{z}, zmm2/m512/m64bcst`"},{"name":"Description","value":"This instruction performs a SIMD computation of the approximate reciprocals of eight/four/two packed double-precision floating-point values in the source operand (the second operand) and stores the packed double-precision floating-point results in the destination operand. The maximum relative error for this approximation is less than 2-14."},{"name":"​","value":"The source operand can be a ZMM register, a 512-bit memory location, or a 512-bit vector broadcasted from a 64-bit memory location. The destination operand is a ZMM register conditionally updated according to the writemask."},{"name":"​","value":"The VRCP14PD instruction is not affected by the rounding control bits in the MXCSR register. When a source value is a 0.0, an ∞ with the sign of the source value is returned. A denormal source value will be treated as zero only in case of DAZ bit set in MXCSR. Otherwise it is treated correctly (i.e. not as a 0.0). Underflow results are flushed to zero only in case of FTZ bit set in MXCSR. Otherwise it will be treated correctly (i.e. correct underflow result is written) with the sign of the operand. When a source value is a SNaN or QNaN, the SNaN is converted to a QNaN or the source QNaN is returned."},{"name":"​","value":"EVEX.vvvv is reserved and must be 1111b otherwise instructions will #UD."},{"name":"​","value":"MXCSR exception flags are not affected by this instruction and floating-point exceptions are not reported."},{"name":"C/C++ Intriniscs","value":"`VRCP14PD __m512d _mm512_rcp14_pd( __m512d a);\n`"},{"name":"​","value":"`VRCP14PD __m512d _mm512_mask_rcp14_pd(__m512d s, __mmask8 k, __m512d a);\n`"},{"name":"​","value":"`VRCP14PD __m512d _mm512_maskz_rcp14_pd( __mmask8 k, __m512d a);\n`"},{"name":"CPUID Flags","value":"AVX512VL AVX512F"}],"footer":{"text":"Thanks to Felix Cloutier for the online x86 reference"}}