{"title":"VREDUCESS — Perform a Reduction Transformation on a Scalar Float32 Value","fields":[{"name":"Instruction Modes","value":"`/ib VREDUCESS xmm1 {k1}{z}, xmm2, xmm3/m32{sae}, imm8`"},{"name":"Description","value":"Perform a reduction transformation of the binary encoded single-precision FP value in the low dword element of the second source operand (the third operand) and store the reduced result in binary FP format to the low dword element of the destination operand (the first operand) under the writemask k1. Bits 127:32 of the destination operand are copied from respective dword elements of the first source operand (the second operand)."},{"name":"​","value":"The reduction transformation subtracts the integer part and the leading M fractional bits from the binary FP source value, where M is a unsigned integer specified by imm8[7:4], see Figure 5-28. Specifically, the reduction transformation can be expressed as:"},{"name":"​","value":"dest = src – (ROUND(2M*src))*2-M;"},{"name":"​","value":"where “Round()” treats “src”, “2M”, and their product as binary FP numbers with normalized significand and biased exponents."},{"name":"​","value":"The magnitude of the reduced result can be expressed by considering src= 2p*man2,"},{"name":"​","value":"where ‘man2’ is the normalized significand and ‘p’ is the unbiased exponent"},{"name":"​","value":"Then if RC = RNE: 0&lt;=|Reduced Result|&lt;=2p-M-1"},{"name":"​","value":"Then if RC ≠ RNE: 0&lt;=|Reduced Result|&lt;2p-M"},{"name":"​","value":"This instruction might end up with a precision exception set. However, in case of SPE set (i.e. Suppress Precision Exception, which is imm8[3]=1), no precision exception is reported."},{"name":"​","value":"Handling of special case of input values are listed in Table 5-24."},{"name":"C/C++ Intrinsics","value":"`VREDUCESS __m128 _mm_mask_reduce_ss( __m128 a, __m128 b, int imm, int sae)\n`"},{"name":"​","value":"`VREDUCESS __m128 _mm_mask_reduce_ss(__m128 s, __mmask16 k, __m128 a, __m128 b, int imm, int sae)\n`"},{"name":"​","value":"`VREDUCESS __m128 _mm_maskz_reduce_ss(__mmask16 k, __m128 a, __m128 b, int imm, int sae)\n`"},{"name":"CPUID Flags","value":"AVX512DQ"}],"color":65535,"footer":{"text":"Thanks to Felix Cloutier for the online x86 reference"}}